[
  {
    "name": "Jashwanth Kandula",
    "timestamp": "2025-04-26 11:14:37",
    "score": 0,
    "total": 10,
    "topics": "Artificial Intelligence",
    "answers": {
      "q1": {
        "selected": null,
        "correct": "C",
        "explanation": "Explanation: The fundamental concept of AI is to design and develop machines that can mimic human intelligence."
      },
      "q2": {
        "selected": null,
        "correct": "B",
        "explanation": "Explanation: Machine Learning is defined by two types of learning which are Supervised and Unsupervised learning."
      },
      "q3": {
        "selected": null,
        "correct": "D",
        "explanation": "Explanation: The initial stage of the AI model is to collect and prepare the data for further analysis."
      },
      "q4": {
        "selected": null,
        "correct": "D",
        "explanation": "Explanation: Data science is a blend of tools, algorithms, and machine learning principles aiming to reveal hidden patterns from the raw data."
      },
      "q5": {
        "selected": null,
        "correct": "D",
        "explanation": "Explanation: Heuristic refers to a practical approach not guaranteed to be perfect or optimal, but sufficient for reaching immediate goals or solving immediate problems."
      },
      "q6": {
        "selected": null,
        "correct": "B",
        "explanation": "Explanation: Training data is the data which is used to train the machine learning model."
      },
      "q7": {
        "selected": null,
        "correct": "C",
        "explanation": "Explanation: Backpropagation is a supervised learning technique used for training Neural Networks."
      },
      "q8": {
        "selected": null,
        "correct": "A",
        "explanation": "Explanation: Genetic algorithms work on the principle of survival of the fittest. They are used for optimization and search problems."
      },
      "q9": {
        "selected": null,
        "correct": "C",
        "explanation": "Explanation: Overfitting is a concept in machine learning where the model performs better on the training data and poorly on unseen data."
      },
      "q10": {
        "selected": null,
        "correct": "A",
        "explanation": "Explanation: Natural Language Processing (NLP) is a branch of AI that deals with the interaction between computers and humans in natural language."
      }
    }
  }
]